app/controllers/floors_controller.rb

SELECT "floors".* FROM "floors"
---
    def index
        @floors = Floor.all

SELECT  "floors".* FROM "floors" WHERE "floors"."id" = ? LIMIT 1  [["id", 1]]
---
    def edit
        @floor = Floor.find(params[:id])

INSERT INTO "floors" ("name", "json", "level", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "123123"], ["json", ""], ["level", 3], ["created_at", "2016-06-07 14:37:08.952239"], ["updated_at", "2016-06-07 14:37:08.952239"]]
---
    def create
        # def create
        #   render plain: params[:floor].inspect
        # end
        @floor = Floor.new(floor_params)

        if @floor.save

SELECT  "floors".* FROM "floors" WHERE "floors"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "floors" SET "name" = ?, "level" = ?, "updated_at" = ? WHERE "floors"."id" = ?  [["name", "Floor 1"], ["level", 2], ["updated_at", "2016-06-07 13:59:24.940669"], ["id", 1]]
---
    def update
        @floor = Floor.find(params[:id])

        # if @floor.update(floor_params)
        #     # render plain: params[:floor].inspect#
        #     redirect_to @floor
        # else
        #     render 'edit'
        #     # render plain: params[:floor].inspect#
        # end
        respond_to do |format|
            if @floor.update(floor_params)